[
  {
    "campaign_id": "b620fdba-1f4f-41fe-b28b-5aa7984d723c",
    "vendor_name": "H2O Bar",
    "category": "Restaurants",
    "campaign_slogan": "H2O Bar: Sip Fresh, Eat Healthy, Feel Great! ✨",
    "notification": "⏳ Fresh deals at H2O Bar! Use points for 10€ off bowls & juices or grab a free protein boost. Healthy & tasty awaits! Tap now!",
    "campaign_message": "Fuel your day the healthy way at H2O Bar! 🥗 Discover our vibrant Toasts, energizing Bowls, fresh Cold-Pressed Juices & more. Use your points for amazing discounts like €5 off bowls/toasts or a FREE juice! Taste the freshness! 🥑🍓",
    "promotions": [
      "Use 30 points for a free Cold-Pressed Juice (like Power or Detox)!",
      "Use 500 points for €5 off any delicious Toast or Bowl!",
      "Use 250 points for a free Protein Ball add-on!"
    ],
    "timestamp": "2025-05-04T00:40:18.990368"
  },
  {
    "campaign_id": "441de318-cf3e-4468-b170-a401e055222b",
    "vendor_name": "Savored Journeys",
    "category": "Travel and Transportation",
    "campaign_slogan": "Savored Journeys: Your points unlock Paris adventures! ✈️",
    "notification": "🗼Dreaming of Paris? Use points for HUGE savings on your trip with Savored Journeys! ⏳ Spend 2000 points for €20 off tours. Tap for deals!",
    "campaign_message": "Bonjour! ✨ Plan your dream Paris getaway with Savored Journeys! 🥐 Explore iconic sights like the Eiffel Tower & Louvre, indulge in delicious food, and cruise the Seine. Use your points for amazing discounts on tours and experiences recommended by Savored Journeys. Start planning your adventure today! 🇫🇷",
    "promotions": [
      "Use 2000 points for a €20 discount on booking a Paris walking tour through Savored Journeys.",
      "Use 1500 points for 10% off a recommended Paris hotel booking via Savored Journeys.",
      "Use 1000 points for a free Paris Metro guide download from Savored Journeys.",
      "Use 3000 points for a €30 voucher towards a Champagne side trip booked via Savored Journeys."
    ],
    "timestamp": "2025-05-04T00:44:17.011260"
  },
  {
    "campaign_id": "bdff5d43-6f2c-4a21-a268-70310db6267d",
    "vendor_name": "Savored Journeys",
    "category": "Travel and Transportation",
    "campaign_slogan": "Savored Journeys: Your points unlock Paris! 🇫🇷✨",
    "notification": "⏳ Dream trip to Paris? Use points for amazing tours & experiences with Savored Journeys! ✨ Save €€ on cruises & food tours. Tap for deals!",
    "campaign_message": "Bonjour, traveler! 🗼🥐 Explore the magic of Paris with Savored Journeys. Use your points for incredible savings on guided food tours, romantic Seine River cruises, and authentic cooking classes. ✨ Let Savored Journeys guide your perfect Parisian adventure! Redeem points now! 🇫🇷",
    "promotions": [
      "Use 1000 points for €20 off a guided food tour in Paris with Savored Journeys.",
      "Use 750 points for 10% off a Seine River Cruise booking via Savored Journeys.",
      "Use 1500 points for a €30 voucher towards a French cooking class experience recommended by Savored Journeys.",
      "Use 250 points for a downloadable Paris neighborhood guide from Savored Journeys."
    ],
    "timestamp": "2025-05-04T05:56:19.097020"
  }
]